import Text from '../../components/text'
import H from '../../components/heading'

export default function Learn() {

  return (
    <>
        <H>概要</H>
        <Text>この記事では、情報連携学部に入学し、
            授業が始まる前に行うべきことを羅列する。</Text>
        <h2>パソコンの購入</h2>
        <Text>情報連携学部では、学生一人一人にパソコンがあることを前提としてカリキュラムを組んでいる。
            最悪、パソコンが無くてもスマホを使うことで講義スライドは見れるものの、課題のプログラムの作成が困難になるので
            パソコンは入学前に絶対に買っておこう。
        </Text>
        <h2>タイピングの練習</h2>
        <Text>パソコンの入力になれないと、あらゆる活動に遅延が出てしまう。
            入学前に、自分のパソコンを使ってタイピングの練習をしておこう。
            おすすめのタイピング練習としては、タイピングのゲームができるサイトで毎日1時間ぐらい練習するのがおすすめ。
            最終的に、寿司打の高級コースで利益を出せればいいだろう。</Text>
        <h2>pythonの予習</h2>
        <Text>入学前に、基本的な部分を習得しておくと予後がいい。</Text>
        <h2>Xの登録 & 大学垢の作成</h2>
        <Text>Xに大学垢を作り、他の情報連携学部生をフォローすることで、大学内の情報の収集が簡単になる。
            ほかにも、入学前にSNSで知り合いを作れるというメリットもある。</Text>
        <H>関連リンク</H>
        <Text><a href="https://sushida.net/">寿司打</a></Text>
          
    </>
  );
}