import { Text } from '../../components/text'
import { H } from '../../components/heading'

export default function Sns() {
  return (
    <>
        <Text>未完成</Text>
        <H>概要</H>
        <Text>
            この記事では、大学で使うパソコン選びのコツを紹介するつもりだったが、筆者のパソコンへの知識があまりなく、
            適当な記事しか書けないので、ここではあえて「パソコンを選ぶための情報収集のコツ」を紹介する程度にとどめる。</Text>
        <H>Xにいる先輩に聞く</H>
        <Text>
            とりあえず、Xで「INIAD」って検索したら出てくるアカウントに、DMを送り、パソコン選びのコツを聞けばいいと思う。
            その先輩がパソコンに詳しいかはわからないが、とりあえず有益な情報は聞き出せると思うし、その先輩との繋がりを持てるので
            ためらわずに聞いておこう。
        </Text>
    </>
  );
}